% 从CPF矩阵计算得到刚度阵
clear all;
clc;
ef=324;  %纤维的杨氏模量
em=3;    %基体的杨氏模量
vf=0.3;  %纤维的泊松比
vm=0.3;  %基体的泊松比
wf=0.6;  %纤维的体积分数
wm=1-wf; %基体的体积分数
gf=0.5*ef/(1+vf);  %纤维的剪切模量 
gm=0.5*em/(1+vm);  %基体的剪切模量
s=zeros(3,3);      %初始化柔度矩阵
s(1,1)=(wf*ef+wm*em+(wf*wm*ef*em*(vf-vm)^2)/(wf*ef*(1-vm^2)+wm*em*(1-vf^2)))^-1;     %柔度矩阵分量S11
s(2,2)=wf/ef+wm/em-(2*wf*wm*(vf*em-vm*ef)^2)/((1-vf)*wm*ef*em^2+(1-vm)*wf*em*ef^2);  %柔度矩阵分量S22
s(3,3)=wf/gf+wm/gm;%柔度矩阵分量S33
s(1,2)=(wf*vf+wm*vm-vf*vm)/(wf*vm*ef+wm*vf*em-wf*ef-wm*em);  %柔度矩阵分量S12
s(2,1)=s(1,2);     %柔度矩阵分量S21
c=s^-1;            %求解刚度矩阵
f11=1;
f22=sqrt(-c(2,2)*(c(1,2)*f11^2-c(1,2)-c(2,2)))/c(2,2);
f12=0;
f21=0;
duf=zeros(4,4);    %初始化偏P/偏F矩阵
duf(1,1)=0.5*c(1,1)*(3*f11^2+f21^2-1)+f12^2*c(3,3)+0.5*c(1,2)*(f12^2+f22^2-1)+c(1,3)*(3*f11*f12+f21*f22);  %以下为偏P/偏F矩阵的分量计算
duf(1,2)=f21*f12*c(3,3)+f11*f22*c(1,2)+f11*f21*c(1,3)+f12*f22*c(2,3);
duf(1,3)=(2*f11*f12+f21*f22)*c(3,3)+f11*f12*c(1,2)+0.5*(3*f11^2+f21^2-1)*c(1,3)+0.5*(3*f12^2+f22^2-1)*c(2,3);
duf(1,4)=f11*f21*c(1,1)+f12*f22*c(3,3)+f11*f22*c(1,3)+f21*f12*c(1,3);
duf(2,2)=0.5*(f12^2+3*f22^2-1)*c(2,2)+f21^2*c(3,3)+0.5*(f11^2+f21^2-1)*c(1,2)+(f11*f12+3*f21*f22)*c(2,3);
duf(2,3)=f12*f22*c(2,2)+f11*f21*c(3,3)+(f21*f12+f11*f22)*c(2,3);
duf(2,4)=(f11*f12+2*f21*f22)*c(3,3)+f21*f22*c(1,2)+0.5*(f11^2+3*f21^2-1)*c(1,3)+0.5*(f12^2+3*f22^2-1)*c(2,3);
duf(3,3)=0.5*(3*f12^2+f22^2-1)*c(2,2)+f11^2*c(3,3)+0.5*(f11^2+f21^2-1)*c(1,2)+(3*f11*f12+f21*f22)*c(2,3);
duf(3,4)=f11*f22*c(3,3)+f21*f12*c(1,2)+f21*f11*c(1,3)+f22*f12*c(2,3);
duf(4,4)=0.5*(f11^2+3*f21^2-1)*c(1,1)+f22^2*c(3,3)+0.5*(f12^2+f22^2-1)*c(1,2)+(f11*f12+3*f21*f22)*c(1,3);
duf(2,1)=duf(1,2); 
duf(3,1)=duf(1,3);
duf(4,1)=duf(1,4);
duf(3,2)=duf(2,3);
duf(4,2)=duf(2,4);
duf(4,3)=duf(3,4);

B=[0 0 -1 0 1 0;0 1 0 -1 0 0;1 0 -1 0 0 0;0 0 0 -1 0 1]';
K=1/2*B*duf*B';
miniK=K([2,6],[2,6])
eig(miniK)